nxp-mcuxpresso/mcux-sdk/devices/MIMXRT1189/gcc/startup_MIMXRT1189_cm7.S
    .align  1
    .thumb_func
    .weak DefaultISR
    .type DefaultISR, %function
DefaultISR:
    b DefaultISR
    .size DefaultISR, . - DefaultISR

    .align 1
    .thumb_func
    .weak NMI_Handler
    .type NMI_Handler, %function
NMI_Handler:
    ldr   r0,=NMI_Handler
    bx    r0
    .size NMI_Handler, . - NMI_Handler

    .align 1
    .thumb_func
    .weak HardFault_Handler
    .type HardFault_Handler, %function
HardFault_Handler:
    ldr   r0,=HardFault_Handler
    bx    r0
    .size HardFault_Handler, . - HardFault_Handler

    .align 1
    .thumb_func
    .weak SVC_Handler
    .type SVC_Handler, %function
SVC_Handler:
    ldr   r0,=SVC_Handler
    bx    r0
    .size SVC_Handler, . - SVC_Handler

    .align 1
    .thumb_func
    .weak PendSV_Handler
    .type PendSV_Handler, %function
PendSV_Handler:
    ldr   r0,=PendSV_Handler
    bx    r0
    .size PendSV_Handler, . - PendSV_Handler

    .align 1
    .thumb_func
    .weak SysTick_Handler
    .type SysTick_Handler, %function
SysTick_Handler:
    ldr   r0,=SysTick_Handler
    bx    r0
    .size SysTick_Handler, . - SysTick_Handler

    .align 1
    .thumb_func
    .weak CAN1_IRQHandler
    .type CAN1_IRQHandler, %function
CAN1_IRQHandler:
    ldr   r0,=CAN1_DriverIRQHandler
    bx    r0
    .size CAN1_IRQHandler, . - CAN1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN1_ERROR_IRQHandler
    .type CAN1_ERROR_IRQHandler, %function
CAN1_ERROR_IRQHandler:
    ldr   r0,=CAN1_ERROR_DriverIRQHandler
    bx    r0
    .size CAN1_ERROR_IRQHandler, . - CAN1_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak I3C1_IRQHandler
    .type I3C1_IRQHandler, %function
I3C1_IRQHandler:
    ldr   r0,=I3C1_DriverIRQHandler
    bx    r0
    .size I3C1_IRQHandler, . - I3C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C1_IRQHandler
    .type LPI2C1_IRQHandler, %function
LPI2C1_IRQHandler:
    ldr   r0,=LPI2C1_DriverIRQHandler
    bx    r0
    .size LPI2C1_IRQHandler, . - LPI2C1_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C2_IRQHandler
    .type LPI2C2_IRQHandler, %function
LPI2C2_IRQHandler:
    ldr   r0,=LPI2C2_DriverIRQHandler
    bx    r0
    .size LPI2C2_IRQHandler, . - LPI2C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI1_IRQHandler
    .type LPSPI1_IRQHandler, %function
LPSPI1_IRQHandler:
    ldr   r0,=LPSPI1_DriverIRQHandler
    bx    r0
    .size LPSPI1_IRQHandler, . - LPSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI2_IRQHandler
    .type LPSPI2_IRQHandler, %function
LPSPI2_IRQHandler:
    ldr   r0,=LPSPI2_DriverIRQHandler
    bx    r0
    .size LPSPI2_IRQHandler, . - LPSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART1_IRQHandler
    .type LPUART1_IRQHandler, %function
LPUART1_IRQHandler:
    ldr   r0,=LPUART1_DriverIRQHandler
    bx    r0
    .size LPUART1_IRQHandler, . - LPUART1_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART2_IRQHandler
    .type LPUART2_IRQHandler, %function
LPUART2_IRQHandler:
    ldr   r0,=LPUART2_DriverIRQHandler
    bx    r0
    .size LPUART2_IRQHandler, . - LPUART2_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_EVENT_IRQHandler
    .type PDM_HWVAD_EVENT_IRQHandler, %function
PDM_HWVAD_EVENT_IRQHandler:
    ldr   r0,=PDM_HWVAD_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_EVENT_IRQHandler, . - PDM_HWVAD_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_HWVAD_ERROR_IRQHandler
    .type PDM_HWVAD_ERROR_IRQHandler, %function
PDM_HWVAD_ERROR_IRQHandler:
    ldr   r0,=PDM_HWVAD_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_HWVAD_ERROR_IRQHandler, . - PDM_HWVAD_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_EVENT_IRQHandler
    .type PDM_EVENT_IRQHandler, %function
PDM_EVENT_IRQHandler:
    ldr   r0,=PDM_EVENT_DriverIRQHandler
    bx    r0
    .size PDM_EVENT_IRQHandler, . - PDM_EVENT_IRQHandler

    .align 1
    .thumb_func
    .weak PDM_ERROR_IRQHandler
    .type PDM_ERROR_IRQHandler, %function
PDM_ERROR_IRQHandler:
    ldr   r0,=PDM_ERROR_DriverIRQHandler
    bx    r0
    .size PDM_ERROR_IRQHandler, . - PDM_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak SAI1_IRQHandler
    .type SAI1_IRQHandler, %function
SAI1_IRQHandler:
    ldr   r0,=SAI1_DriverIRQHandler
    bx    r0
    .size SAI1_IRQHandler, . - SAI1_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_IRQHandler
    .type CAN2_IRQHandler, %function
CAN2_IRQHandler:
    ldr   r0,=CAN2_DriverIRQHandler
    bx    r0
    .size CAN2_IRQHandler, . - CAN2_IRQHandler

    .align 1
    .thumb_func
    .weak CAN2_ERROR_IRQHandler
    .type CAN2_ERROR_IRQHandler, %function
CAN2_ERROR_IRQHandler:
    ldr   r0,=CAN2_ERROR_DriverIRQHandler
    bx    r0
    .size CAN2_ERROR_IRQHandler, . - CAN2_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO1_IRQHandler
    .type FLEXIO1_IRQHandler, %function
FLEXIO1_IRQHandler:
    ldr   r0,=FLEXIO1_DriverIRQHandler
    bx    r0
    .size FLEXIO1_IRQHandler, . - FLEXIO1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXIO2_IRQHandler
    .type FLEXIO2_IRQHandler, %function
FLEXIO2_IRQHandler:
    ldr   r0,=FLEXIO2_DriverIRQHandler
    bx    r0
    .size FLEXIO2_IRQHandler, . - FLEXIO2_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI1_IRQHandler
    .type FLEXSPI1_IRQHandler, %function
FLEXSPI1_IRQHandler:
    ldr   r0,=FLEXSPI1_DriverIRQHandler
    bx    r0
    .size FLEXSPI1_IRQHandler, . - FLEXSPI1_IRQHandler

    .align 1
    .thumb_func
    .weak FLEXSPI2_IRQHandler
    .type FLEXSPI2_IRQHandler, %function
FLEXSPI2_IRQHandler:
    ldr   r0,=FLEXSPI2_DriverIRQHandler
    bx    r0
    .size FLEXSPI2_IRQHandler, . - FLEXSPI2_IRQHandler

    .align 1
    .thumb_func
    .weak I3C2_IRQHandler
    .type I3C2_IRQHandler, %function
I3C2_IRQHandler:
    ldr   r0,=I3C2_DriverIRQHandler
    bx    r0
    .size I3C2_IRQHandler, . - I3C2_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C3_IRQHandler
    .type LPI2C3_IRQHandler, %function
LPI2C3_IRQHandler:
    ldr   r0,=LPI2C3_DriverIRQHandler
    bx    r0
    .size LPI2C3_IRQHandler, . - LPI2C3_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C4_IRQHandler
    .type LPI2C4_IRQHandler, %function
LPI2C4_IRQHandler:
    ldr   r0,=LPI2C4_DriverIRQHandler
    bx    r0
    .size LPI2C4_IRQHandler, . - LPI2C4_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI3_IRQHandler
    .type LPSPI3_IRQHandler, %function
LPSPI3_IRQHandler:
    ldr   r0,=LPSPI3_DriverIRQHandler
    bx    r0
    .size LPSPI3_IRQHandler, . - LPSPI3_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI4_IRQHandler
    .type LPSPI4_IRQHandler, %function
LPSPI4_IRQHandler:
    ldr   r0,=LPSPI4_DriverIRQHandler
    bx    r0
    .size LPSPI4_IRQHandler, . - LPSPI4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART3_IRQHandler
    .type LPUART3_IRQHandler, %function
LPUART3_IRQHandler:
    ldr   r0,=LPUART3_DriverIRQHandler
    bx    r0
    .size LPUART3_IRQHandler, . - LPUART3_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART4_IRQHandler
    .type LPUART4_IRQHandler, %function
LPUART4_IRQHandler:
    ldr   r0,=LPUART4_DriverIRQHandler
    bx    r0
    .size LPUART4_IRQHandler, . - LPUART4_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART5_IRQHandler
    .type LPUART5_IRQHandler, %function
LPUART5_IRQHandler:
    ldr   r0,=LPUART5_DriverIRQHandler
    bx    r0
    .size LPUART5_IRQHandler, . - LPUART5_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART6_IRQHandler
    .type LPUART6_IRQHandler, %function
LPUART6_IRQHandler:
    ldr   r0,=LPUART6_DriverIRQHandler
    bx    r0
    .size LPUART6_IRQHandler, . - LPUART6_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC1_IRQHandler
    .type USDHC1_IRQHandler, %function
USDHC1_IRQHandler:
    ldr   r0,=USDHC1_DriverIRQHandler
    bx    r0
    .size USDHC1_IRQHandler, . - USDHC1_IRQHandler

    .align 1
    .thumb_func
    .weak USDHC2_IRQHandler
    .type USDHC2_IRQHandler, %function
USDHC2_IRQHandler:
    ldr   r0,=USDHC2_DriverIRQHandler
    bx    r0
    .size USDHC2_IRQHandler, . - USDHC2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA_ERROR_IRQHandler
    .type DMA_ERROR_IRQHandler, %function
DMA_ERROR_IRQHandler:
    ldr   r0,=DMA_ERROR_DriverIRQHandler
    bx    r0
    .size DMA_ERROR_IRQHandler, . - DMA_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH0_IRQHandler
    .type DMA3_CH0_IRQHandler, %function
DMA3_CH0_IRQHandler:
    ldr   r0,=DMA3_CH0_DriverIRQHandler
    bx    r0
    .size DMA3_CH0_IRQHandler, . - DMA3_CH0_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH1_IRQHandler
    .type DMA3_CH1_IRQHandler, %function
DMA3_CH1_IRQHandler:
    ldr   r0,=DMA3_CH1_DriverIRQHandler
    bx    r0
    .size DMA3_CH1_IRQHandler, . - DMA3_CH1_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH2_IRQHandler
    .type DMA3_CH2_IRQHandler, %function
DMA3_CH2_IRQHandler:
    ldr   r0,=DMA3_CH2_DriverIRQHandler
    bx    r0
    .size DMA3_CH2_IRQHandler, . - DMA3_CH2_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH3_IRQHandler
    .type DMA3_CH3_IRQHandler, %function
DMA3_CH3_IRQHandler:
    ldr   r0,=DMA3_CH3_DriverIRQHandler
    bx    r0
    .size DMA3_CH3_IRQHandler, . - DMA3_CH3_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH4_IRQHandler
    .type DMA3_CH4_IRQHandler, %function
DMA3_CH4_IRQHandler:
    ldr   r0,=DMA3_CH4_DriverIRQHandler
    bx    r0
    .size DMA3_CH4_IRQHandler, . - DMA3_CH4_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH5_IRQHandler
    .type DMA3_CH5_IRQHandler, %function
DMA3_CH5_IRQHandler:
    ldr   r0,=DMA3_CH5_DriverIRQHandler
    bx    r0
    .size DMA3_CH5_IRQHandler, . - DMA3_CH5_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH6_IRQHandler
    .type DMA3_CH6_IRQHandler, %function
DMA3_CH6_IRQHandler:
    ldr   r0,=DMA3_CH6_DriverIRQHandler
    bx    r0
    .size DMA3_CH6_IRQHandler, . - DMA3_CH6_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH7_IRQHandler
    .type DMA3_CH7_IRQHandler, %function
DMA3_CH7_IRQHandler:
    ldr   r0,=DMA3_CH7_DriverIRQHandler
    bx    r0
    .size DMA3_CH7_IRQHandler, . - DMA3_CH7_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH8_IRQHandler
    .type DMA3_CH8_IRQHandler, %function
DMA3_CH8_IRQHandler:
    ldr   r0,=DMA3_CH8_DriverIRQHandler
    bx    r0
    .size DMA3_CH8_IRQHandler, . - DMA3_CH8_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH9_IRQHandler
    .type DMA3_CH9_IRQHandler, %function
DMA3_CH9_IRQHandler:
    ldr   r0,=DMA3_CH9_DriverIRQHandler
    bx    r0
    .size DMA3_CH9_IRQHandler, . - DMA3_CH9_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH10_IRQHandler
    .type DMA3_CH10_IRQHandler, %function
DMA3_CH10_IRQHandler:
    ldr   r0,=DMA3_CH10_DriverIRQHandler
    bx    r0
    .size DMA3_CH10_IRQHandler, . - DMA3_CH10_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH11_IRQHandler
    .type DMA3_CH11_IRQHandler, %function
DMA3_CH11_IRQHandler:
    ldr   r0,=DMA3_CH11_DriverIRQHandler
    bx    r0
    .size DMA3_CH11_IRQHandler, . - DMA3_CH11_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH12_IRQHandler
    .type DMA3_CH12_IRQHandler, %function
DMA3_CH12_IRQHandler:
    ldr   r0,=DMA3_CH12_DriverIRQHandler
    bx    r0
    .size DMA3_CH12_IRQHandler, . - DMA3_CH12_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH13_IRQHandler
    .type DMA3_CH13_IRQHandler, %function
DMA3_CH13_IRQHandler:
    ldr   r0,=DMA3_CH13_DriverIRQHandler
    bx    r0
    .size DMA3_CH13_IRQHandler, . - DMA3_CH13_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH14_IRQHandler
    .type DMA3_CH14_IRQHandler, %function
DMA3_CH14_IRQHandler:
    ldr   r0,=DMA3_CH14_DriverIRQHandler
    bx    r0
    .size DMA3_CH14_IRQHandler, . - DMA3_CH14_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH15_IRQHandler
    .type DMA3_CH15_IRQHandler, %function
DMA3_CH15_IRQHandler:
    ldr   r0,=DMA3_CH15_DriverIRQHandler
    bx    r0
    .size DMA3_CH15_IRQHandler, . - DMA3_CH15_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH16_IRQHandler
    .type DMA3_CH16_IRQHandler, %function
DMA3_CH16_IRQHandler:
    ldr   r0,=DMA3_CH16_DriverIRQHandler
    bx    r0
    .size DMA3_CH16_IRQHandler, . - DMA3_CH16_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH17_IRQHandler
    .type DMA3_CH17_IRQHandler, %function
DMA3_CH17_IRQHandler:
    ldr   r0,=DMA3_CH17_DriverIRQHandler
    bx    r0
    .size DMA3_CH17_IRQHandler, . - DMA3_CH17_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH18_IRQHandler
    .type DMA3_CH18_IRQHandler, %function
DMA3_CH18_IRQHandler:
    ldr   r0,=DMA3_CH18_DriverIRQHandler
    bx    r0
    .size DMA3_CH18_IRQHandler, . - DMA3_CH18_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH19_IRQHandler
    .type DMA3_CH19_IRQHandler, %function
DMA3_CH19_IRQHandler:
    ldr   r0,=DMA3_CH19_DriverIRQHandler
    bx    r0
    .size DMA3_CH19_IRQHandler, . - DMA3_CH19_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH20_IRQHandler
    .type DMA3_CH20_IRQHandler, %function
DMA3_CH20_IRQHandler:
    ldr   r0,=DMA3_CH20_DriverIRQHandler
    bx    r0
    .size DMA3_CH20_IRQHandler, . - DMA3_CH20_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH21_IRQHandler
    .type DMA3_CH21_IRQHandler, %function
DMA3_CH21_IRQHandler:
    ldr   r0,=DMA3_CH21_DriverIRQHandler
    bx    r0
    .size DMA3_CH21_IRQHandler, . - DMA3_CH21_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH22_IRQHandler
    .type DMA3_CH22_IRQHandler, %function
DMA3_CH22_IRQHandler:
    ldr   r0,=DMA3_CH22_DriverIRQHandler
    bx    r0
    .size DMA3_CH22_IRQHandler, . - DMA3_CH22_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH23_IRQHandler
    .type DMA3_CH23_IRQHandler, %function
DMA3_CH23_IRQHandler:
    ldr   r0,=DMA3_CH23_DriverIRQHandler
    bx    r0
    .size DMA3_CH23_IRQHandler, . - DMA3_CH23_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH24_IRQHandler
    .type DMA3_CH24_IRQHandler, %function
DMA3_CH24_IRQHandler:
    ldr   r0,=DMA3_CH24_DriverIRQHandler
    bx    r0
    .size DMA3_CH24_IRQHandler, . - DMA3_CH24_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH25_IRQHandler
    .type DMA3_CH25_IRQHandler, %function
DMA3_CH25_IRQHandler:
    ldr   r0,=DMA3_CH25_DriverIRQHandler
    bx    r0
    .size DMA3_CH25_IRQHandler, . - DMA3_CH25_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH26_IRQHandler
    .type DMA3_CH26_IRQHandler, %function
DMA3_CH26_IRQHandler:
    ldr   r0,=DMA3_CH26_DriverIRQHandler
    bx    r0
    .size DMA3_CH26_IRQHandler, . - DMA3_CH26_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH27_IRQHandler
    .type DMA3_CH27_IRQHandler, %function
DMA3_CH27_IRQHandler:
    ldr   r0,=DMA3_CH27_DriverIRQHandler
    bx    r0
    .size DMA3_CH27_IRQHandler, . - DMA3_CH27_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH28_IRQHandler
    .type DMA3_CH28_IRQHandler, %function
DMA3_CH28_IRQHandler:
    ldr   r0,=DMA3_CH28_DriverIRQHandler
    bx    r0
    .size DMA3_CH28_IRQHandler, . - DMA3_CH28_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH29_IRQHandler
    .type DMA3_CH29_IRQHandler, %function
DMA3_CH29_IRQHandler:
    ldr   r0,=DMA3_CH29_DriverIRQHandler
    bx    r0
    .size DMA3_CH29_IRQHandler, . - DMA3_CH29_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH30_IRQHandler
    .type DMA3_CH30_IRQHandler, %function
DMA3_CH30_IRQHandler:
    ldr   r0,=DMA3_CH30_DriverIRQHandler
    bx    r0
    .size DMA3_CH30_IRQHandler, . - DMA3_CH30_IRQHandler

    .align 1
    .thumb_func
    .weak DMA3_CH31_IRQHandler
    .type DMA3_CH31_IRQHandler, %function
DMA3_CH31_IRQHandler:
    ldr   r0,=DMA3_CH31_DriverIRQHandler
    bx    r0
    .size DMA3_CH31_IRQHandler, . - DMA3_CH31_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_ERROR_IRQHandler
    .type DMA4_ERROR_IRQHandler, %function
DMA4_ERROR_IRQHandler:
    ldr   r0,=DMA4_ERROR_DriverIRQHandler
    bx    r0
    .size DMA4_ERROR_IRQHandler, . - DMA4_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH0_CH1_CH32_CH33_IRQHandler
    .type DMA4_CH0_CH1_CH32_CH33_IRQHandler, %function
DMA4_CH0_CH1_CH32_CH33_IRQHandler:
    ldr   r0,=DMA4_CH0_CH1_CH32_CH33_DriverIRQHandler
    bx    r0
    .size DMA4_CH0_CH1_CH32_CH33_IRQHandler, . - DMA4_CH0_CH1_CH32_CH33_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH2_CH3_CH34_CH35_IRQHandler
    .type DMA4_CH2_CH3_CH34_CH35_IRQHandler, %function
DMA4_CH2_CH3_CH34_CH35_IRQHandler:
    ldr   r0,=DMA4_CH2_CH3_CH34_CH35_DriverIRQHandler
    bx    r0
    .size DMA4_CH2_CH3_CH34_CH35_IRQHandler, . - DMA4_CH2_CH3_CH34_CH35_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH4_CH5_CH36_CH37_IRQHandler
    .type DMA4_CH4_CH5_CH36_CH37_IRQHandler, %function
DMA4_CH4_CH5_CH36_CH37_IRQHandler:
    ldr   r0,=DMA4_CH4_CH5_CH36_CH37_DriverIRQHandler
    bx    r0
    .size DMA4_CH4_CH5_CH36_CH37_IRQHandler, . - DMA4_CH4_CH5_CH36_CH37_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH6_CH7_CH38_CH39_IRQHandler
    .type DMA4_CH6_CH7_CH38_CH39_IRQHandler, %function
DMA4_CH6_CH7_CH38_CH39_IRQHandler:
    ldr   r0,=DMA4_CH6_CH7_CH38_CH39_DriverIRQHandler
    bx    r0
    .size DMA4_CH6_CH7_CH38_CH39_IRQHandler, . - DMA4_CH6_CH7_CH38_CH39_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH8_CH9_CH40_CH41_IRQHandler
    .type DMA4_CH8_CH9_CH40_CH41_IRQHandler, %function
DMA4_CH8_CH9_CH40_CH41_IRQHandler:
    ldr   r0,=DMA4_CH8_CH9_CH40_CH41_DriverIRQHandler
    bx    r0
    .size DMA4_CH8_CH9_CH40_CH41_IRQHandler, . - DMA4_CH8_CH9_CH40_CH41_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH10_CH11_CH42_CH43_IRQHandler
    .type DMA4_CH10_CH11_CH42_CH43_IRQHandler, %function
DMA4_CH10_CH11_CH42_CH43_IRQHandler:
    ldr   r0,=DMA4_CH10_CH11_CH42_CH43_DriverIRQHandler
    bx    r0
    .size DMA4_CH10_CH11_CH42_CH43_IRQHandler, . - DMA4_CH10_CH11_CH42_CH43_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH12_CH13_CH44_CH45_IRQHandler
    .type DMA4_CH12_CH13_CH44_CH45_IRQHandler, %function
DMA4_CH12_CH13_CH44_CH45_IRQHandler:
    ldr   r0,=DMA4_CH12_CH13_CH44_CH45_DriverIRQHandler
    bx    r0
    .size DMA4_CH12_CH13_CH44_CH45_IRQHandler, . - DMA4_CH12_CH13_CH44_CH45_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH14_CH15_CH46_CH47_IRQHandler
    .type DMA4_CH14_CH15_CH46_CH47_IRQHandler, %function
DMA4_CH14_CH15_CH46_CH47_IRQHandler:
    ldr   r0,=DMA4_CH14_CH15_CH46_CH47_DriverIRQHandler
    bx    r0
    .size DMA4_CH14_CH15_CH46_CH47_IRQHandler, . - DMA4_CH14_CH15_CH46_CH47_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH16_CH17_CH48_CH49_IRQHandler
    .type DMA4_CH16_CH17_CH48_CH49_IRQHandler, %function
DMA4_CH16_CH17_CH48_CH49_IRQHandler:
    ldr   r0,=DMA4_CH16_CH17_CH48_CH49_DriverIRQHandler
    bx    r0
    .size DMA4_CH16_CH17_CH48_CH49_IRQHandler, . - DMA4_CH16_CH17_CH48_CH49_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH18_CH19_CH50_CH51_IRQHandler
    .type DMA4_CH18_CH19_CH50_CH51_IRQHandler, %function
DMA4_CH18_CH19_CH50_CH51_IRQHandler:
    ldr   r0,=DMA4_CH18_CH19_CH50_CH51_DriverIRQHandler
    bx    r0
    .size DMA4_CH18_CH19_CH50_CH51_IRQHandler, . - DMA4_CH18_CH19_CH50_CH51_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH20_CH21_CH52_CH53_IRQHandler
    .type DMA4_CH20_CH21_CH52_CH53_IRQHandler, %function
DMA4_CH20_CH21_CH52_CH53_IRQHandler:
    ldr   r0,=DMA4_CH20_CH21_CH52_CH53_DriverIRQHandler
    bx    r0
    .size DMA4_CH20_CH21_CH52_CH53_IRQHandler, . - DMA4_CH20_CH21_CH52_CH53_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH22_CH23_CH54_CH55_IRQHandler
    .type DMA4_CH22_CH23_CH54_CH55_IRQHandler, %function
DMA4_CH22_CH23_CH54_CH55_IRQHandler:
    ldr   r0,=DMA4_CH22_CH23_CH54_CH55_DriverIRQHandler
    bx    r0
    .size DMA4_CH22_CH23_CH54_CH55_IRQHandler, . - DMA4_CH22_CH23_CH54_CH55_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH24_CH25_CH56_CH57_IRQHandler
    .type DMA4_CH24_CH25_CH56_CH57_IRQHandler, %function
DMA4_CH24_CH25_CH56_CH57_IRQHandler:
    ldr   r0,=DMA4_CH24_CH25_CH56_CH57_DriverIRQHandler
    bx    r0
    .size DMA4_CH24_CH25_CH56_CH57_IRQHandler, . - DMA4_CH24_CH25_CH56_CH57_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH26_CH27_CH58_CH59_IRQHandler
    .type DMA4_CH26_CH27_CH58_CH59_IRQHandler, %function
DMA4_CH26_CH27_CH58_CH59_IRQHandler:
    ldr   r0,=DMA4_CH26_CH27_CH58_CH59_DriverIRQHandler
    bx    r0
    .size DMA4_CH26_CH27_CH58_CH59_IRQHandler, . - DMA4_CH26_CH27_CH58_CH59_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH28_CH29_CH60_CH61_IRQHandler
    .type DMA4_CH28_CH29_CH60_CH61_IRQHandler, %function
DMA4_CH28_CH29_CH60_CH61_IRQHandler:
    ldr   r0,=DMA4_CH28_CH29_CH60_CH61_DriverIRQHandler
    bx    r0
    .size DMA4_CH28_CH29_CH60_CH61_IRQHandler, . - DMA4_CH28_CH29_CH60_CH61_IRQHandler

    .align 1
    .thumb_func
    .weak DMA4_CH30_CH31_CH62_CH63_IRQHandler
    .type DMA4_CH30_CH31_CH62_CH63_IRQHandler, %function
DMA4_CH30_CH31_CH62_CH63_IRQHandler:
    ldr   r0,=DMA4_CH30_CH31_CH62_CH63_DriverIRQHandler
    bx    r0
    .size DMA4_CH30_CH31_CH62_CH63_IRQHandler, . - DMA4_CH30_CH31_CH62_CH63_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C5_IRQHandler
    .type LPI2C5_IRQHandler, %function
LPI2C5_IRQHandler:
    ldr   r0,=LPI2C5_DriverIRQHandler
    bx    r0
    .size LPI2C5_IRQHandler, . - LPI2C5_IRQHandler

    .align 1
    .thumb_func
    .weak LPI2C6_IRQHandler
    .type LPI2C6_IRQHandler, %function
LPI2C6_IRQHandler:
    ldr   r0,=LPI2C6_DriverIRQHandler
    bx    r0
    .size LPI2C6_IRQHandler, . - LPI2C6_IRQHandler

    .align 1
    .thumb_func
    .weak SAI4_IRQHandler
    .type SAI4_IRQHandler, %function
SAI4_IRQHandler:
    ldr   r0,=SAI4_DriverIRQHandler
    bx    r0
    .size SAI4_IRQHandler, . - SAI4_IRQHandler

    .align 1
    .thumb_func
    .weak SPDIF_IRQHandler
    .type SPDIF_IRQHandler, %function
SPDIF_IRQHandler:
    ldr   r0,=SPDIF_DriverIRQHandler
    bx    r0
    .size SPDIF_IRQHandler, . - SPDIF_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART9_IRQHandler
    .type LPUART9_IRQHandler, %function
LPUART9_IRQHandler:
    ldr   r0,=LPUART9_DriverIRQHandler
    bx    r0
    .size LPUART9_IRQHandler, . - LPUART9_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART10_IRQHandler
    .type LPUART10_IRQHandler, %function
LPUART10_IRQHandler:
    ldr   r0,=LPUART10_DriverIRQHandler
    bx    r0
    .size LPUART10_IRQHandler, . - LPUART10_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART11_IRQHandler
    .type LPUART11_IRQHandler, %function
LPUART11_IRQHandler:
    ldr   r0,=LPUART11_DriverIRQHandler
    bx    r0
    .size LPUART11_IRQHandler, . - LPUART11_IRQHandler

    .align 1
    .thumb_func
    .weak LPUART12_IRQHandler
    .type LPUART12_IRQHandler, %function
LPUART12_IRQHandler:
    ldr   r0,=LPUART12_DriverIRQHandler
    bx    r0
    .size LPUART12_IRQHandler, . - LPUART12_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_IRQHandler
    .type CAN3_IRQHandler, %function
CAN3_IRQHandler:
    ldr   r0,=CAN3_DriverIRQHandler
    bx    r0
    .size CAN3_IRQHandler, . - CAN3_IRQHandler

    .align 1
    .thumb_func
    .weak CAN3_ERROR_IRQHandler
    .type CAN3_ERROR_IRQHandler, %function
CAN3_ERROR_IRQHandler:
    ldr   r0,=CAN3_ERROR_DriverIRQHandler
    bx    r0
    .size CAN3_ERROR_IRQHandler, . - CAN3_ERROR_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI5_IRQHandler
    .type LPSPI5_IRQHandler, %function
LPSPI5_IRQHandler:
    ldr   r0,=LPSPI5_DriverIRQHandler
    bx    r0
    .size LPSPI5_IRQHandler, . - LPSPI5_IRQHandler

    .align 1
    .thumb_func
    .weak LPSPI6_IRQHandler
    .type LPSPI6_IRQHandler, %function
LPSPI6_IRQHandler:
    ldr   r0,=LPSPI6_DriverIRQHandler
    bx    r0
    .size LPSPI6_IRQHandler, . - LPSPI6_IRQHandler

